Documents/НормыРасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>НормыРасхода</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НормыРасхода</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтароеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НормыРасхода/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.НормыРасхода.ПолучитьМакет("Печать");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НормыРасхода.Дата КАК Дата,
		|	НормыРасхода.Номер КАК Номер,
		|	НормыРасхода.Продукция КАК Продукция,
		|	НормыРасхода.Материалы.(
		|		ЕдиницыИзмерения КАК ЕдиницыИзмерения,
		|		Материал КАК Материал,
		|		НовоеКоличество КАК НовоеКоличество
		|	) КАК Материалы,
		|	НормыРасхода.Продукция.ЕдиницыИзмерения.Наименование КАК ПродукцияЕдиницыИзмеренияНаименование,
		|	НаименованиеОрганизации.Значение КАК НаименованиеОрганизации,
		|	Руководитель.Значение.ФамилияИнициалы КАК ФамилияИнициалыРуководителя,
		|	ОтветсвенныйЗаКалькуляцию.Значение КАК ОтветсвенныйЗаКалькуляцию
		|ИЗ
		|	Документ.НормыРасхода КАК НормыРасхода,
		|	Константа.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	Константа.Руководитель КАК Руководитель,
		|	Константа.ОтветсвенныйЗаКалькуляцию КАК ОтветсвенныйЗаКалькуляцию
		|ГДЕ
		|	НормыРасхода.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьМатериалыШапка = Макет.ПолучитьОбласть("МатериалыШапка");
		ОбластьМатериалы = Макет.ПолучитьОбласть("Материалы");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.ДатаПрописью = Формат(Выборка.Дата, "ДЛФ=DD");
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ОбластьМатериалыШапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьМатериалыШапка);
			ВыборкаМатериалы = Выборка.Материалы.Выбрать();
			Нумератор = 1;		
			Пока ВыборкаМатериалы.Следующий() Цикл
				Если ВыборкаМатериалы.НовоеКоличество <> 0 Тогда
					НомерСтроки = Нумератор;
					ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
					ОбластьМатериалы.Параметры.ЕдиницыИзмерения = ВыборкаМатериалы.Материал.ЕдиницыИзмерения;
					ОбластьМатериалы.Параметры.НомерСТроки = Нумератор;
					Нумератор = Нумератор + 1;
					ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
				КонецЕсли;
			КонецЦикла;
			
			ОбластьПодвал.Параметры.ДолжностьОтветсвенного = Выборка.ОтветсвенныйЗаКалькуляцию.Должность;
			ОбластьПодвал.Параметры.ФИООтвественного = Выборка.ОтветсвенныйЗаКалькуляцию.ФамилияИнициалы;
			ТабДок.Вывести(ОбластьПодвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
